In [23]:
import pandas as pd

In [53]:
dates = pd.date_range('20211123', periods=7)

In [54]:
dates

DatetimeIndex(['2021-11-23', '2021-11-24', '2021-11-25', '2021-11-26',
               '2021-11-27', '2021-11-28', '2021-11-29'],
              dtype='datetime64[ns]', freq='D')

In [55]:
import numpy as np

In [56]:
df = pd.DataFrame(np.random.randn(7,4), index=dates, columns=['A','B','C','D'])

In [57]:
df

                   A         B         C         D
2021-11-23  0.828108 -1.785795  0.524080  1.482793
2021-11-24 -0.627852 -0.063944 -0.244753 -0.653724
2021-11-25 -0.252841  2.136296  1.025334  0.095756
2021-11-26  1.602846 -0.606848  0.904416 -0.399628
2021-11-27 -0.594374 -1.876874 -0.933800 -0.035057
2021-11-28 -0.569733  0.156573 -0.682352  0.429504
2021-11-29 -1.348708 -0.324089  0.438141  1.080996

In [58]:
type(df)

pandas.core.frame.DataFrame

In [59]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [60]:
df.index

DatetimeIndex(['2021-11-23', '2021-11-24', '2021-11-25', '2021-11-26',
               '2021-11-27', '2021-11-28', '2021-11-29'],
              dtype='datetime64[ns]', freq='D')

In [61]:
df.values

array([[ 0.82810779, -1.7857952 ,  0.52408016,  1.48279325],
       [-0.62785243, -0.06394434, -0.24475337, -0.65372389],
       [-0.25284091,  2.136296  ,  1.02533398,  0.09575553],
       [ 1.60284649, -0.60684767,  0.90441636, -0.39962834],
       [-0.59437413, -1.87687435, -0.9337997 , -0.03505682],
       [-0.5697326 ,  0.15657266, -0.68235213,  0.42950403],
       [-1.34870783, -0.32408876,  0.43814124,  1.08099583]])

In [62]:
df.describe()

              A         B         C         D
count  7.000000  7.000000  7.000000  7.000000
mean  -0.137508 -0.337812  0.147295  0.285806
std    1.006441  1.352687  0.772607  0.772158
min   -1.348708 -1.876874 -0.933800 -0.653724
25%   -0.611113 -1.196321 -0.463553 -0.217343
50%   -0.569733 -0.324089  0.438141  0.095756
75%    0.287633  0.046314  0.714248  0.755250
max    1.602846  2.136296  1.025334  1.482793

In [63]:
df.sort_values(by='A')

                   A         B         C         D
2021-11-29 -1.348708 -0.324089  0.438141  1.080996
2021-11-24 -0.627852 -0.063944 -0.244753 -0.653724
2021-11-27 -0.594374 -1.876874 -0.933800 -0.035057
2021-11-28 -0.569733  0.156573 -0.682352  0.429504
2021-11-25 -0.252841  2.136296  1.025334  0.095756
2021-11-23  0.828108 -1.785795  0.524080  1.482793
2021-11-26  1.602846 -0.606848  0.904416 -0.399628

In [64]:
df.sort_values(by='A', ascending=False)

                   A         B         C         D
2021-11-26  1.602846 -0.606848  0.904416 -0.399628
2021-11-23  0.828108 -1.785795  0.524080  1.482793
2021-11-25 -0.252841  2.136296  1.025334  0.095756
2021-11-28 -0.569733  0.156573 -0.682352  0.429504
2021-11-27 -0.594374 -1.876874 -0.933800 -0.035057
2021-11-24 -0.627852 -0.063944 -0.244753 -0.653724
2021-11-29 -1.348708 -0.324089  0.438141  1.080996

In [65]:
df['A']

2021-11-23    0.828108
2021-11-24   -0.627852
2021-11-25   -0.252841
2021-11-26    1.602846
2021-11-27   -0.594374
2021-11-28   -0.569733
2021-11-29   -1.348708
Freq: D, Name: A, dtype: float64

In [66]:
type(df['A'])

pandas.core.series.Series

In [67]:
df[0:3]

                   A         B         C         D
2021-11-23  0.828108 -1.785795  0.524080  1.482793
2021-11-24 -0.627852 -0.063944 -0.244753 -0.653724
2021-11-25 -0.252841  2.136296  1.025334  0.095756

In [69]:
df.loc['2021-11-23']

A    0.828108
B   -1.785795
C    0.524080
D    1.482793
Name: 2021-11-23 00:00:00, dtype: float64

In [70]:
df.loc['2021-11-23','A']

0.8281077865692232

In [71]:
df.loc['2021-11-23',['A','C']]

A    0.828108
C    0.524080
Name: 2021-11-23 00:00:00, dtype: float64

In [72]:
df.loc['2021-11-23':'2021-11-24',['A','B']]

                   A         B
2021-11-23  0.828108 -1.785795
2021-11-24 -0.627852 -0.063944

In [73]:
df.loc[:,['A','B']]

                   A         B
2021-11-23  0.828108 -1.785795
2021-11-24 -0.627852 -0.063944
2021-11-25 -0.252841  2.136296
2021-11-26  1.602846 -0.606848
2021-11-27 -0.594374 -1.876874
2021-11-28 -0.569733  0.156573
2021-11-29 -1.348708 -0.324089

In [75]:
df.iloc[0:2]
# 숫자로 출력하기?

                   A         B         C         D
2021-11-23  0.828108 -1.785795  0.524080  1.482793
2021-11-24 -0.627852 -0.063944 -0.244753 -0.653724

In [78]:
df.iloc[0:2,0:2]
# 행과 열에서 2줄만 출력하기

                   A         B
2021-11-23  0.828108 -1.785795
2021-11-24 -0.627852 -0.063944

In [83]:
df.iloc[[0,1,5],0:2]
# 0,1,5번째 행과 2열만 출력하기

                   A         B
2021-11-23  0.828108 -1.785795
2021-11-24 -0.627852 -0.063944
2021-11-28 -0.569733  0.156573

In [80]:
df['A']>0

2021-11-23     True
2021-11-24    False
2021-11-25    False
2021-11-26     True
2021-11-27    False
2021-11-28    False
2021-11-29    False
Freq: D, Name: A, dtype: bool

In [88]:
df[df['A']>0]
# A값중 0보다 큰값만 출력

                   A         B         C         D
2021-11-23  0.828108 -1.785795  0.524080  1.482793
2021-11-26  1.602846 -0.606848  0.904416 -0.399628

In [89]:
df>0
# 0보다 큰값들은 true 아니면 false

                A      B      C      D
2021-11-23   True  False   True   True
2021-11-24  False  False  False  False
2021-11-25  False   True   True   True
2021-11-26   True  False   True  False
2021-11-27  False  False  False  False
2021-11-28  False   True  False   True
2021-11-29  False  False   True   True

In [90]:
df[df>0]
# 0보다 큰값들만 출력

                   A         B         C         D
2021-11-23  0.828108       NaN  0.524080  1.482793
2021-11-24       NaN       NaN       NaN       NaN
2021-11-25       NaN  2.136296  1.025334  0.095756
2021-11-26  1.602846       NaN  0.904416       NaN
2021-11-27       NaN       NaN       NaN       NaN
2021-11-28       NaN  0.156573       NaN  0.429504
2021-11-29       NaN       NaN  0.438141  1.080996

In [94]:
df2 = pd.DataFrame(df, columns=['A','C','D','B'])
df2
# 순서도 간단히 바꿔줄수있음

                   A         C         D         B
2021-11-23  0.828108  0.524080  1.482793 -1.785795
2021-11-24 -0.627852 -0.244753 -0.653724 -0.063944
2021-11-25 -0.252841  1.025334  0.095756  2.136296
2021-11-26  1.602846  0.904416 -0.399628 -0.606848
2021-11-27 -0.594374 -0.933800 -0.035057 -1.876874
2021-11-28 -0.569733 -0.682352  0.429504  0.156573
2021-11-29 -1.348708  0.438141  1.080996 -0.324089

In [96]:
df['E'] = np.nan
df
# NaN 값을가진 새로운 행E 붙임

                   A         B         C         D   E
2021-11-23  0.828108 -1.785795  0.524080  1.482793 NaN
2021-11-24 -0.627852 -0.063944 -0.244753 -0.653724 NaN
2021-11-25 -0.252841  2.136296  1.025334  0.095756 NaN
2021-11-26  1.602846 -0.606848  0.904416 -0.399628 NaN
2021-11-27 -0.594374 -1.876874 -0.933800 -0.035057 NaN
2021-11-28 -0.569733  0.156573 -0.682352  0.429504 NaN
2021-11-29 -1.348708 -0.324089  0.438141  1.080996 NaN

In [98]:
df.loc['2021-11-24','E']=2
df
# E행의 '2021-11-24' 행에 값 2를 대입함

                   A         B         C         D    E
2021-11-23  0.828108 -1.785795  0.524080  1.482793  NaN
2021-11-24 -0.627852 -0.063944 -0.244753 -0.653724  2.0
2021-11-25 -0.252841  2.136296  1.025334  0.095756  NaN
2021-11-26  1.602846 -0.606848  0.904416 -0.399628  NaN
2021-11-27 -0.594374 -1.876874 -0.933800 -0.035057  NaN
2021-11-28 -0.569733  0.156573 -0.682352  0.429504  NaN
2021-11-29 -1.348708 -0.324089  0.438141  1.080996  NaN

In [100]:
df['F']=df['A']+df['B']
df
# A행과 B행을 더하여 F칼럼에 추가하여 df에 붙임

                   A         B         C         D    E         F
2021-11-23  0.828108 -1.785795  0.524080  1.482793  NaN -0.957687
2021-11-24 -0.627852 -0.063944 -0.244753 -0.653724  2.0 -0.691797
2021-11-25 -0.252841  2.136296  1.025334  0.095756  NaN  1.883455
2021-11-26  1.602846 -0.606848  0.904416 -0.399628  NaN  0.995999
2021-11-27 -0.594374 -1.876874 -0.933800 -0.035057  NaN -2.471248
2021-11-28 -0.569733  0.156573 -0.682352  0.429504  NaN -0.413160
2021-11-29 -1.348708 -0.324089  0.438141  1.080996  NaN -1.672797

In [101]:
!pip install xlrd

Requirement already satisfied: xlrd in c:\users\toyha\anaconda3\lib\site-packages (2.0.1)

In [115]:
pd.read_excel("./day1/data/teen.xls")
# ./ 뜻은 현재 디렉토리 라는뜻!

,기간,구분,스트레스 인지율,스트레스 인지율.1,스트레스 인지율.2,우울감 경험률,우울감 경험률.1,우울감 경험률.2,자살 생각률,자살 생각률.1,자살 생각률.2
0,기간,구분,전체,남학생,여학생,전체,남학생,여학생,전체,남학생,여학생
1,2020,구분,35.1,29.8,40.8,25.4,21.2,29.9,11.2,8.8,13.8

In [106]:
pd.read_excel("./day1/data/teen.xls", header=1)

     기간 구분     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  2020  구분  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [108]:
pd.read_excel("./day1/data/teen.xls", header=1, usecols="C:K")

     전체   남학생   여학생  전체.1  남학생.1  여학생.1  전체.2  남학생.2  여학생.2
0  35.1  29.8  40.8  25.4   21.2   29.9  11.2    8.8   13.8

In [110]:
col_names=['스트레스', '스트레스남학생', '스트레스여학생', '우울감경험율', '우울남학생', '우울여학생', '자살생각율', '자살남학생','자살여학생']

pd.read_excel("./day1/data/teen.xls", header=1, usecols="C:K", names=col_names)

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8

In [113]:
raw_data = pd.read_excel("./day1/data/teen.xls", header=1, usecols="C:K", names=col_names)
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8

In [114]:
raw_data.loc[1] = 100 - raw_data.loc[0]
raw_data

   스트레스  스트레스남학생  스트레스여학생  우울감경험율  우울남학생  우울여학생  자살생각율  자살남학생  자살여학생
0  35.1     29.8     40.8    25.4   21.2   29.9   11.2    8.8   13.8
1  64.9     70.2     59.2    74.6   78.8   70.1   88.8   91.2   86.2